# IdeaStatiCa.ConnectionApi.Model.CheckResPlate

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**Name** | **string** |  | [optional]
**CheckStatus** | **bool** |  | [optional]
**LoadCaseId** | **int** |  | [optional]
**MaxStrain** | **double** |  | [optional]
**MaxStress** | **double** |  | [optional]
**Items** | **List&lt;int&gt;** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)